{"Dissertation/Dissertation":{"title":"Dissertation","links":[],"tags":[],"content":"(Well I obviously need to pass the defence before I publish it here, no?)"},"Dissertation/Reading-Material":{"title":"Reading Material","links":[],"tags":[],"content":"Kalman Filter\nPreamble Fundamentals\nReading Material\nAn improved Sage Husa adaptive robust Kalman Filter for de-noising the MEMS IMU drift signal\nwww.sciencedirect.com/science/article/pii/S2352484722003523\nRobust M–M unscented Kalman filtering for GPS/IMU navigation\nEmbedded Kalman Filter for Inertial Measurement Unit (IMU) on the ATMega8535\n(ebookcentral.proquest.com/lib/abdn/reader.action)"},"Neat-Stuff-I-Found/Neat-Index":{"title":"Neat Index","links":[],"tags":[],"content":"\n\n                  \n                  Note\n                  \n                \nThis list is organised like an Awesome listing repository\n\nComputing\nEmbedded Devices\nOS, System,\nConstruction\nPlastering\nCarpentry\nOrganising\nGardening\nCultivars\n3D-Printing"},"Personal-Content-List":{"title":"Personal Content List","links":[],"tags":[],"content":""},"Personal-Projects/Personal-Webpage":{"title":"Personal Webpage","links":[],"tags":[],"content":""},"Personal-Projects/ProtoTAU":{"title":"ProtoTAU","links":[],"tags":[],"content":""},"Personal-Projects/Real-Autonomous-Gardening":{"title":"Real Autonomous Gardening","links":[],"tags":[],"content":"Preamble\nOne part of multiple automated gardening systems hobbyist projects has always irked and annoyed me - none of them are reliable or controlling enough to leave them alone to the elements to tend to your crops.\nLeaving behind the plants at the flat, coming back later than expected and seeing them all dead already. Never really trusting the pumping and dripping machines to be left alone, as many times it has behaved funnily or something loosening up and being a rude wet awakening on the floor.\nConstraints\nThis project is take along the rabbit hole of attempting a system to follow the specific constraints\n\n\nIt can be left alone with no human touch or configuration for at least 3 months.\n\n\nIt can adapt towards the increasing demand of the plant and potential issues such as disease or lack of water.\n\n\nIt doesn’t require extremely specific tools and parts besides sensors, microcontroller(s) and basic screwdriver to build it.\n\n\n(Optional) It can harvest the said fruits of the labour.\n\n\nDate Updates"},"Projects-List":{"title":"Projects List","links":["Personal-Projects/ProtoTAU","Personal-Projects/Personal-Webpage","Personal-Projects/Real-Autonomous-Gardening"],"tags":[],"content":"Currently I am working actively in:\n\nEverything electrical and electronic in ProtoTAU\nMisadventures of my own making my own blog page framework\n\nWhat I am planning to do in the future:\n\nReal Autonomous Gardening\n"},"Thoughts-Preamble":{"title":"Thoughts Preamble","links":[],"tags":[],"content":""},"index":{"title":"Welcome to My Blog!","links":["Projects-List","Thoughts-Preamble","Personal-Content-List","Neat-Stuff-I-Found/Neat-Index"],"tags":[],"content":"Hello there! My name’s Christine and I do some engineering, particularly electrical and electronics.\nThis is my personal blog and website I use to share projects I am working on, thoughts and other personal content I would like to share.\nI also put the neat stuff I found here as well to not forget I found that said neat thing and for others to also see that neat thing.\nI hope you enjoy taking a sleuthing around my blog. This isn’t much, but it’s mine."}}